In [40]:
import pandas as pd
from sqlalchemy import create_engine 
from sqlalchemy.orm import Session

In [14]:
csv_file ="../group_project_2_copy/Resources/unemployment.csv"
unemployment_df= pd.read_csv(csv_file)
unemployment_df.head()

C:\Users\juliebaker\anaconda3Win\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value Flag Codes
0      AUS       HUR     TOT   PC_LF         A  1967  1.875        NaN
1      AUS       HUR     TOT   PC_LF         A  1968  1.850        NaN
2      AUS       HUR     TOT   PC_LF         A  1969  1.800        NaN
3      AUS       HUR     TOT   PC_LF         A  1970  1.625        NaN
4      AUS       HUR     TOT   PC_LF         A  1971  1.925        NaN

csv_file_2 ="../group_project_2/Resources/indexInfo.csv"
indexInfo_df= pd.read_csv(csv_file_2)
indexInfo_df.head()

csv_file_3 ="../group_project_2/Resources/indexProcessed.csv"
indexProcessed_df= pd.read_csv(csv_file_3)
indexProcessed_df.head()

In [5]:
rds_connection_string = "postgres:Class123@localhost:5432/stock_exchange"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [6]:
engine.table_names()

['indexinfo', 'indexdata', 'unemployment']

In [15]:
unemployment_df.to_sql(name='unemployment', con=engine, if_exists='append', index=True,index_label='id')

indexData_df.to_sql(name='indexdata', con=engine, if_exists='append', index=True, index_label='id')

In [26]:
pd.read_sql_query(f'select * from unemployment', con=engine).head()

   id LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value Flag Codes
0   0      AUS       HUR     TOT   PC_LF         A  1967  1.875       None
1   1      AUS       HUR     TOT   PC_LF         A  1968  1.850       None
2   2      AUS       HUR     TOT   PC_LF         A  1969  1.800       None
3   3      AUS       HUR     TOT   PC_LF         A  1970  1.625       None
4   4      AUS       HUR     TOT   PC_LF         A  1971  1.925       None

In [72]:
query1="""select * from unemployment where "LOCATION" = 'USA' OR "LOCATION" = 'CAN' OR "LOCATION" = 'CHE' OR "LOCATION" = 'DEU' OR "LOCATION" = 'JPN' OR "LOCATION" = 'KOR' OR "LOCATION" = 'EA19' OR "LOCATION" = 'EU27_2020'"""
redux_unemp_df1=pd.read_sql_query(query1, con=engine)
# pd.read_sql_query("select * from unemployment WHERE "LOCATION" = 'USA'", con=engine).head()

In [73]:
redux_unemp_df1

,id,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,120,CAN,HUR,TOT,PC_LF,A,1955,4.408333,None
1,121,CAN,HUR,TOT,PC_LF,A,1956,3.433333,None
2,122,CAN,HUR,TOT,PC_LF,A,1957,4.650000,None
3,123,CAN,HUR,TOT,PC_LF,A,1958,7.066667,None
4,124,CAN,HUR,TOT,PC_LF,A,1959,5.991667,None
...,...,...,...,...,...,...,...,...,...
16264,65367,EU27_2020,HUR,WOMEN,PC_LF,M,2021-02,7.800000,None
16265,65368,EU27_2020,HUR,WOMEN,PC_LF,M,2021-03,7.800000,None
16266,65369,EU27_2020,HUR,WOMEN,PC_LF,M,2021-04,7.800000,None
16267,65370,EU27_2020,HUR,WOMEN,PC_LF,M,2021-05,7.700000,None
16268,65371,EU27_2020,HUR,WOMEN,PC_LF,M,2021-06,7.500000,None

In [74]:
query2="""select * from unemployment where "SUBJECT" = 'TOT'"""
redux_unemp_df2=pd.read_sql_query(query2, con=engine)

In [75]:
redux_unemp_df2

,id,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,0,AUS,HUR,TOT,PC_LF,A,1967,1.87500,None
1,1,AUS,HUR,TOT,PC_LF,A,1968,1.85000,None
2,2,AUS,HUR,TOT,PC_LF,A,1969,1.80000,None
3,3,AUS,HUR,TOT,PC_LF,A,1970,1.62500,None
4,4,AUS,HUR,TOT,PC_LF,A,1971,1.92500,None
...,...,...,...,...,...,...,...,...,...
22140,65784,CRI,HUR,TOT,PC_LF,M,2020-12,19.40858,None
22141,65785,CRI,HUR,TOT,PC_LF,M,2021-01,18.73122,None
22142,65786,CRI,HUR,TOT,PC_LF,M,2021-02,18.85617,None
22143,65787,CRI,HUR,TOT,PC_LF,M,2021-03,17.31250,None
22144,65788,CRI,HUR,TOT,PC_LF,M,2021-04,17.59673,None

In [87]:
query="""select * from unemployment where "SUBJECT" = 'TOT' AND ("LOCATION" = 'USA' OR "LOCATION" = 'CAN' OR "LOCATION" = 'CHE' OR "LOCATION" = 'DEU' OR "LOCATION" = 'JPN' OR "LOCATION" = 'KOR' OR "LOCATION" = 'EA19' OR "LOCATION" = 'EU27_2020')"""
redux_unemp_df=pd.read_sql_query(query, con=engine)
# pd.read_sql_query("select * from unemployment WHERE "LOCATION" = 'USA'", con=engine).head()

In [88]:
redux_unemp_df

,id,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,120,CAN,HUR,TOT,PC_LF,A,1955,4.408333,None
1,121,CAN,HUR,TOT,PC_LF,A,1956,3.433333,None
2,122,CAN,HUR,TOT,PC_LF,A,1957,4.650000,None
3,123,CAN,HUR,TOT,PC_LF,A,1958,7.066667,None
4,124,CAN,HUR,TOT,PC_LF,A,1959,5.991667,None
...,...,...,...,...,...,...,...,...,...
5396,21958,EU27_2020,HUR,TOT,PC_LF,M,2021-02,7.500000,None
5397,21959,EU27_2020,HUR,TOT,PC_LF,M,2021-03,7.400000,None
5398,21960,EU27_2020,HUR,TOT,PC_LF,M,2021-04,7.500000,None
5399,21961,EU27_2020,HUR,TOT,PC_LF,M,2021-05,7.300000,None
5400,21962,EU27_2020,HUR,TOT,PC_LF,M,2021-06,7.100000,None

In [94]:
redux_unemp_df.to_sql(name='redux_unemp', con=engine, if_exists='append', index=False)

In [22]:
pd.read_sql_query('select * from indexdata', con=engine).head()

,id,Index,Date,Open,High,Low,Close,Adj Close,Volume
0,0,NYA,1965-12-31,528.690002,528.690002,528.690002,528.690002,528.690002,0.0
1,1,NYA,1966-01-03,527.210022,527.210022,527.210022,527.210022,527.210022,0.0
2,2,NYA,1966-01-04,527.840027,527.840027,527.840027,527.840027,527.840027,0.0
3,3,NYA,1966-01-05,531.119995,531.119995,531.119995,531.119995,531.119995,0.0
4,4,NYA,1966-01-06,532.070007,532.070007,532.070007,532.070007,532.070007,0.0